import psycopg2
import random
from datetime import datetime, timedelta

# Підключення до сервера PostgreSQL
conn = psycopg2.connect(
    dbname="prog_comp",
    user="root",
    password="root",
    host="localhost",
    port="5432"
)

# Створення курсора для виконання SQL-запитів
cur = conn.cursor()

# Внесення інформації до таблиці "Помилки" (20 записів)
cur.execute("""
    INSERT INTO errors (error_code,error_description, error_date, error_severity, error_category, error_source)
    VALUES
    (1,'Помилка 1', '2023-10-30 08:00:00', 'критична', 'інтерфейс', 'користувач'),
    (2,'Помилка 2', '2023-10-29 12:30:00', 'важлива', 'дані', 'тестувальник'),
    (3,'Помилка 3', '2023-10-28 15:45:00', 'незначна', 'розрахунковий алгоритм', 'користувач'),
    (4,'Помилка 4', '2023-10-27 09:00:00', 'важлива', 'розрахунковий алгоритм', 'користувач'),
    (5,'Помилка 5', '2023-10-26 14:20:00', 'незначна', 'інше', 'тестувальник'),
    (6,'Помилка 6', '2023-10-25 13:10:00', 'критична', 'дані', 'користувач'),
    (7,'Помилка 7', '2023-10-24 10:30:00', 'незначна', 'розрахунковий алгоритм', 'тестувальник'),
    (8,'Помилка 8', '2023-10-23 11:45:00', 'критична', 'інтерфейс', 'користувач'),
    (9,'Помилка 9', '2023-10-22 12:15:00', 'важлива', 'дані', 'користувач'),
    (10,'Помилка 10', '2023-10-21 09:30:00', 'критична', 'інше', 'тестувальник'),
    (11,'Помилка 11', '2023-10-20 14:00:00', 'незначна', 'розрахунковий алгоритм', 'користувач'),
    (12,'Помилка 12', '2023-10-19 08:15:00', 'критична', 'інтерфейс', 'тестувальник'),
    (13,'Помилка 13', '2023-10-18 10:45:00', 'важлива', 'розрахунковий алгоритм', 'користувач'),
    (14,'Помилка 14', '2023-10-17 11:30:00', 'критична', 'дані', 'користувач'),
    (15,'Помилка 15', '2023-10-16 12:20:00', 'важлива', 'інтерфейс', 'тестувальник'),
    (16,'Помилка 16', '2023-10-15 13:50:00', 'незначна', 'інше', 'користувач'),
    (17,'Помилка 17', '2023-10-14 09:40:00', 'критична', 'розрахунковий алгоритм', 'тестувальник'),
    (18,'Помилка 18', '2023-10-13 08:30:00', 'важлива', 'дані', 'користувач'),
    (19,'Помилка 19', '2023-10-12 15:15:00', 'критична', 'інтерфейс', 'користувач'),
    (20,'Помилка 20', '2023-10-11 14:10:00', 'незначна', 'невідома категорія', 'тестувальник');
""")

# Внесення інформації до таблиці "Програмісти" (4 записи)
cur.execute("""
    INSERT INTO programmers (programmer_code,last_name, first_name, phone_number)
    VALUES
    (1,'Петренко', 'Петро', '+1234567890'),
    (2,'Іваненко', 'Іван', '+9876543210'),
    (3,'Земов', 'Сергій', '+1112223333'),
    (4,'Програмістенко', 'Програміст', '+4445556666');
""")

# Внесення інформації до таблиці "Виправлення помилок" (припустимо, що для кожної помилки виправлення відбулося, тобто 20 записів)
cur.execute("""
    INSERT INTO error_fixes (error_code, fix_start_date, fix_duration, programmer_code, work_cost)
    VALUES
    (1, '2023-10-31 10:00:00', 1, 1, 500.00),
    (2, '2023-10-30 14:00:00', 3, 2, 800.00),
    (3, '2023-10-29 16:30:00', 2, 3, 1200.00),
    (4, '2023-10-28 12:00:00', 2, 4, 700.00),
    (5, '2023-10-27 09:30:00', 1, 1, 500.00),
    (6, '2023-10-26 14:15:00', 2, 2, 900.00),
    (7, '2023-10-25 10:20:00', 3, 3, 800.00),
    (8, '2023-10-24 15:30:00', 1, 1, 500.00),
    (9, '2023-10-23 11:45:00', 2, 2, 700.00),
    (10, '2023-10-22 13:10:00', 2, 3, 1000.00),
    (11, '2023-10-21 09:00:00', 1, 4, 550.00),
    (12, '2023-10-20 11:20:00', 2, 1, 800.00),
    (13, '2023-10-19 10:45:00', 1, 2, 1200.00),
    (14, '2023-10-18 09:30:00', 3, 3, 500.00),
    (15, '2023-10-17 16:00:00', 1, 4, 700.00),
    (16, '2023-10-16 12:15:00', 2, 1, 1000.00),
    (17, '2023-10-15 10:30:00', 3, 2, 550.00),
    (18, '2023-10-14 11:20:00', 3, 3, 800.00),
    (19, '2023-10-13 14:45:00', 1, 4, 1200.00),
    (20, '2023-10-12 08:40:00', 2, 1, 500.00);
""")


# Збереження змін у базі даних
conn.commit()

# Закриття підключення
cur.close()
conn.close()
